# Поработайте с переменными, создайте несколько, выведите на экран
a = 3
b = 0.9
name = "Python"
print("Version " + name + " " + str(a+b))
# запросите у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран.
name = input( "Введите своё имя: " )
fam = input("Введите свою фамилию: ")
day = input( "Укажите число рождения: " )
month = input( "Укажите месяц в котором вы родились: " )
year = input( "Укажите год рождения: ")
print( "Привет, " + name + " " + fam + "!" )
print( "Дата твоего рождения: " + day + " " + month + " " + year)